{[1 2 3 [1 2]] 1 .= [ 1 0 0 [ 1 0 ] ] } test.test
{"abc" "Abc" {=} .& [0 1 1]} test.test

{ [1 2 3 4] [2 3] .- [ 1 2 ] } test.test
{ [1 2 3 4] 2 .- [ 1 2 4 ] } test.test

.# TODO: .| locals appears to be a bit broken
.{
{ {: a("hi") b(a), }.locals :{ "hi":a {a}:b } }
aya> {: a("hi") b(a), }
{:  b(a) a("hi"),} 
aya> {: a("hi") b(a), } .locals
:{} 
aya> {: a b, }:locals
{: b a,} 
aya> {: a b, }.locals
:{
  0:b;
  0:a;
} 
aya> {: a(1) b, }.locals
:{
  0:b;
} 
.}
